anthropic.claude-code
azurite.azurite
davidanson.vscode-markdownlint
docsmsft.docs-yaml
eamodio.gitlens
firefox-devtools.vscode-firefox-debug
github.copilot
github.copilot-chat
github.github-vscode-theme
kisstkondoros.vscode-gutter-preview
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-bicep
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.live-server
ms-vscode.powershell
pkief.material-icon-theme
redhat.vscode-yaml
s-nlf-fh.glassit
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
zignd.html-css-class-completion
